{
  "name": "レッドストーンカード",
  "sortnum": 4,
  "category": "laserio:cards",
  "icon": "laserio:card_redstone",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "レッドストーンカードは、LaserIOネットワーク全体にレッドストーン信号を送信するために使用されます。$(br2)レッドストーンカードには、他のカードが使用するチャンネルとは別に、専用の「レッドストーンチャンネル」があります。"
    },
    {
      "type": "patchouli:text",
      "text": "レッドストーンカードには2つのモードがあります:$(br2)$(bold)入力$()$(br)入力モードでは、レッドストーン ダスト、レバー、ボタンなどからレッドストーン信号を受け取り、カードに設定されているレッドストーンチャンネルを介してネットワーク経由で送信します。$(br2)$(bold)出力$()$(br)出力では、レッドストーンダスト、ランプ、リピーターなどのブロックにレッドストーン信号が送信されます。"
    },
    {
      "type": "patchouli:text",
      "text": "出力モードには、弱と強を切り替えるボタンがあります。弱モードでは、レッドストーンダストの動作と同様に、レッドストーンなどの直接隣接するブロックのみが信号を取得します。$(br2)強モードでは、レッドストーン信号は隣接するブロックを通過し、レバーの動作と同様に反対側のブロックに影響を与えます。"
    },
    {
      "type": "patchouli:text",
      "text": "すべてのカードにはレッドストーンモードの切り替えスイッチがあり、デフォルトでは無視されるため、カードは常に動作します。$(br2)低に設定すると、カードはレッドストーンチャンネルにレッドストーン信号がない場合にのみ動作します (チャンネルボタンはレッドストーン切り替えスイッチの右側にあります)。$(br2) レッドストーンの高モードでは、カードはレッドストーンチャンネルにレッドストーン信号がある場合にのみ動作します。"
    },
    {
      "type": "patchouli:text",
      "text": "より複雑なレッドストーンの要求に対応する設定がいくつかあります:$(br2)$(bold)入力側$()$(br)しきい値モードに切り替えると、制限と出力の2つのボタンが表示されます。$(br2)制限は、レッドストーンチャンネルで信号が送信されるタイミング(等しいかそれより大きい)を決定します。$(br)有効にすると、信号強度は指定された出力と等しくなります。"
    },
    {
      "type": "patchouli:text",
      "text": "$(bold)出力側$()$(br)相補はチャンネル信号を受け取り、15-その値を出力します。$(br)NOT は相補に似ていますが、チャンネルに信号がない場合にのみ15の信号強度を出力します。チャンネルからの信号は何も出力されません。$(br2)最後に、「論理演算」モードです。これらの設定は、別のレッドストーンチャンネルを使用して、既に選択されているチャンネルでブール演算を実行します。$(br2)可能な演算については、次のページに記載されています。"
    },
    {
      "type": "patchouli:text",
      "text": "論理演算モードでは、OR、AND、XOR の3種類のブール演算子が提供されます。$(br2)OR は、いずれかのチャンネルに電力が供給されている場合に信号を発信します。$(br)AND は、両方のチャンネルに電力が供給されている場合にのみ信号を発信します。$(br)XOR は、2つのチャンネルのうちの1つに電力が供給されているときに信号を発します。$(br2)論理演算設定を相補/NOT と組み合わせて、否定バージョン (NOR、NAND、XNOR) を取得できます。"
    },
    {
      "type": "patchouli:crafting",
      "title": "レッドストーンカード",
      "recipe": "laserio:card_redstone"
    }
  ]
}